#
# TA-kaspersky
# props.conf
#

#
# Configuration using the LEEF option
#
[kaspersky]
disabled = false
pulldown_type = true
category = Network & Security
description = Kaspersky ES events (LEEF)

KV_MODE = none

TIME_FORMAT = %Y-%m-%d %H:%M:%S
TIME_PREFIX = devTime\=
MAX_TIMESTAMP_LOOKAHEAD = 19
SHOULD_LINEMERGE = false
LINE_BREAKER = ([\n\r]+)
TRUNCATE = 999999

TRANSFORMS-rename = kaspersky_audit, kaspersky_threat, kaspersky_devctrl, kaspersky_system, kaspersky_appctrl

REPORT-basefields = kaspersky_basefields
FIELDALIAS-eventtype =  log_type AS eventtype

###### CIM FIELDS ######
### Malware Attacks
FIELDALIAS-date = devTime AS date

EVAL-dest = coalesce(dest_name,dest_ip,dest_host,dest)
FIELDALIAS-destname = identNetBios AS dest_name
FIELDALIAS-destip = identSrc AS dest_ip
EVAL-dest = coalesce(dest_name,dest_ip,dest_host,dest)
EVAL-src = coalesce(src_name,src_ip,src_host,src)

EXTRACT-file = EVC_EV_FILE_Name=(?P<file_path>(?:(?:[^\\]+)(?:[\\]+))+)(?P<file_name>[^\t]*)

EXTRACT-user = User[\:\=]\s?(?:[^\\]*\\)?(?P<user>[^\s\r\n]*)
FIELDALIAS-vendorproduct = EVC_EV_KL_PRODUCT_NAME AS client_vendor_product

### Malware Operations
FIELDALIAS-productversion = EVC_EV_KL_PRODUCT_VER AS client_product_version

#
# Configuration using the CEF format 
# (DEPRECATED - See new sourcetype in the V2 section)
#
#[kaspersky:cef]
#pulldown_type = true
#category = Network & Security
#description = Kaspersky ES events (CEF)

#TIME_FORMAT = %s
#TIME_PREFIX = rt\=
#MAX_TIMESTAMP_LOOKAHEAD = 15
#SHOULD_LINEMERGE = false
#LINE_BREAKER = ([\n\r]+)
#TRUNCATE = 999999

#REPORT-basefields = kaspersky_basefields
#TRANSFORMS-rename = kaspersky_threat, kaspersky_devctrl, kaspersky_system, kaspersky_appctrl

#
# Renamed sourcetypes
# (DEPRECATED - See new sourcetypes in the V2 section)
[kaspersky:threat]
pulldown_type = false
MAX_TIMESTAMP_LOOKAHEAD=512
SHOULD_LINEMERGE=false
disabled=false

REPORT-basefields = kaspersky_basefields

###### CIM FIELDS ######
### Malware Attacks
EXTRACT-vendoraction = Result\\Description\:\s+(?<vendor_action>[^\\]*)
FIELDALIAS-date = devTime AS date
EVAL-dest = coalesce(dest_name,dest_ip,dest_host)
FIELDALIAS-destname = identNetBios AS dest_name
FIELDALIAS-destip = identSrc AS dest_ip
EXTRACT-file = EVC_EV_FILE_Name=(?<file_path>(?:(?:[^\\]+)(?:[\\]+))+)(?P<file_name>[^\t]*)
EXTRACT-signature = (?:(?:Result\\Name\:\s+)|(?:Untreated\:\s+)|(?:Deleted\:\s+))(?P<signature>[^\\|\s]*)
EVAL-signature = coalesce(signature,EVC_EV_VIRUS_NAME)
EVAL-src = coalesce(src_name,src_ip,src_host)
EXTRACT-src = Object\:\s+(?P<protocol>[^\s]*)\s+from\s+(?P<src_ip>[^\s]*)\s+to\s+local\s+port\s+(?P<dest_port>[\d]*)
EXTRACT-user = User[\:\=][\s\t]?(?:[^\\]*\\)?(?P<user>.*)(?:\\r\\n)C
FIELDALIAS-vendorproduct = EVC_EV_KL_PRODUCT_NAME AS vendor_product

### Malware Operations
FIELDALIAS-productversion = EVC_EV_KL_PRODUCT_VER AS product_version

### Other
LOOKUP-kaspersky_action_to_action = kaspersky_sc_actions vendor_action OUTPUT action

# (DEPRECATED - See new sourcetype in the V2 section)
[kaspersky:devctrl]
pulldown_type = false
disabled = false

TIME_PREFIX = devTime=
TIME_FORMAT = %Y-%m-%d %H:%M:%S
MAX_TIMESTAMP_LOOKAHEAD = 19
SHOULD_LINEMERGE = false
LINE_BREAKER = ([\n\r]+)
TRUNCATE = 999999

REPORT-basefields = kaspersky_basefields
FIELDALIAS-date = devTime AS date

EXTRACT-file = EVC_EV_FILE_Name=(?P<file_path>(?:(?:[^\\]+)(?:[\\]+))+)(?P<file_name>[^\t]*)

FIELDALIAS-srcname = identNetBios AS src_name
FIELDALIAS-srcip = identSrc AS src_ip
EVAL-src = coalesce(src_name,src_ip,src_host)

FIELDALIAS-destname = identNetBios AS dest_name
FIELDALIAS-destip = identSrc AS dest_ip
EVAL-dest = coalesce(dest_name,dest_ip,dest_host)

EXTRACT-user = User:\s+(?P<user>[^\(]*)
EVAL-user = coalesce(user,usrName)

FIELDALIAS-vendorproduct = EVC_EV_KL_PRODUCT_NAME AS vendor_product
FIELDALIAS-productversion = EVC_EV_KL_PRODUCT_VER AS product_version

# (DEPRECATED - See new sourcetype in the V2 section)
[kaspersky:system]
pulldown_type = false
MAX_TIMESTAMP_LOOKAHEAD=512
SHOULD_LINEMERGE=false
disabled=false
REPORT-basefields = kaspersky_basefields
###### CIM FIELDS ######
### Malware Attacks
FIELDALIAS-date = devTime AS date
FIELDALIAS-destname = identNetBios AS dest_name
FIELDALIAS-destip = identSrc AS dest_ip
EVAL-dest = coalesce(dest_name,dest_ip,dest_host)
EVAL-src = coalesce(src_name,src_ip,src_host)
EXTRACT-user = User:\s+(?P<user>[^\(]*)
EVAL-user = coalesce(user,usrName)
FIELDALIAS-vendorproduct = EVC_EV_KL_PRODUCT_NAME AS vendor_product

### Malware Operations
FIELDALIAS-productversion = EVC_EV_KL_PRODUCT_VER AS product_version

# (DEPRECATED - See new sourcetype in the V2 section)
[kaspersky:appctrl]
pulldown_type = false
MAX_TIMESTAMP_LOOKAHEAD=512
SHOULD_LINEMERGE=false
disabled=false

REPORT-basefields = kaspersky_basefields

###### CIM FIELDS ######
### Malware Attacks
FIELDALIAS-date = devTime AS date
EVAL-dest = coalesce(dest_name,dest_ip,dest_host)
FIELDALIAS-destname = identNetBios AS dest_name
FIELDALIAS-destip = identSrc AS dest_ip
EVAL-src = coalesce(src_name,src_ip,src_host)
FIELDALIAS-vendorproduct = EVC_EV_KL_PRODUCT_NAME AS vendor_product

### Malware Operations
FIELDALIAS-productversion = EVC_EV_KL_PRODUCT_VER AS product_version


# V2
# Base sourcetypes
[kaspersky]
pulldown_type = true
category = Network & Security
description = Kaspersky ES events

KV_MODE = none
SHOULD_LINEMERGE = false
LINE_BREAKER = ([\n\r]+)
TRUNCATE = 999999

TRANSFORMS-rename = kaspersky_klaud, kaspersky_klsrv, kaspersky_gnrl, kaspersky_klnag, kaspersky_pcri

[kaspersky:leef]
disabled = false
pulldown_type = true
category = Network & Security
description = Kaspersky ES events (LEEF)

KV_MODE = none
TIME_FORMAT = %Y-%m-%d %H:%M:%S
TIME_PREFIX = devTime\=
MAX_TIMESTAMP_LOOKAHEAD = 19
SHOULD_LINEMERGE = false
LINE_BREAKER = ([\n\r]+)
TRUNCATE = 999999

TRANSFORMS-rename = kaspersky_klaud, kaspersky_klsrv, kaspersky_gnrl, kaspersky_klnag, kaspersky_pcri

[kaspersky:cef]
pulldown_type = true
category = Network & Security
description = Kaspersky ES events (CEF)

KV_MODE = none
TIME_FORMAT = %s
TIME_PREFIX = rt\=
MAX_TIMESTAMP_LOOKAHEAD = 19
SHOULD_LINEMERGE = false
LINE_BREAKER = ([\n\r]+)
TRUNCATE = 999999

TRANSFORMS-rename = kaspersky_klaud, kaspersky_klsrv, kaspersky_gnrl, kaspersky_klnag, kaspersky_pcri

# Sourcetypes reanmed based on log_type
[kaspersky:klaud]
pulldown_type = false
category = Network & Security

KV_MODE = none
REPORT-basefields = kaspersky_basefields
#REPORT-fields =

# TO MOVE TO TRANSFORMS
#success, failure
EXTRACT-authentication = (?P<vendor_action>has\sconnected\sto\s)
#Authentication	app	string	The application involved in the event (such as ssh, splunk, win:local).	
EXTRACT-dest = identNetBios=(?P<dest_host>[^\t]*)
#Authentication	dest_nt_domain	string	The name of the Active Directory used by the authentication target
#Authentication	duration	    time for the completion of the authentication in seconds.	
#Authentication	response_time	time it took to receive a response in the authentication in seconds.	
#Authentication	signature	string	A human-readable signature name.	
#Authentication	signature_id	string	The unique identifier or event code of the event signature.	
EXTRACT-src = \s+from\s+\"(?P<src>[^\"]*)
#Authentication	src_nt_domain	string	The name of the Active Directory used by the authentication source, if applicable.	
EXTRACT-user = [Uu]ser \"(?:(?P<domain>[^\\]*)\\)?(?P<user>[^\"]*)

EXTRACT-action_modified = (?P<action>modified)\sby
EXTRACT-dvc_name = EVC_EV_DISP_HOST_NAME=(?P<dvc_name>[^\t]*)
EXTRACT-object = EVC_EV_DESC=(?:[^\"]*)"(?P<object>[^\"]*)" modified by user \"(?:(?P<domain>[^\\]*)\\)?(?P<src_user>[^\"]*)

EVAL-app = "kl:sc"
EVAL-dvc = coalesce(dvc_name,dvc_ip,dvc_host)
EVAL-dest = coalesce(dest_name,dest_ip,dest_host,dest)
EVAL-src = coalesce(src_name,src_ip,src_host,src)

LOOKUP-kaspersky_action_to_action = kaspersky_sc_actions vendor_action OUTPUT action

[kaspersky:klsrv]
pulldown_type = false
category = Network & Security

KV_MODE = none
REPORT-basefields = kaspersky_basefields

EVAL-dest = coalesce(dest_name,dest_ip,dest_host,dest)
EVAL-src = coalesce(src_name,src_ip,src_host,src)

LOOKUP-kaspersky_action_to_action = kaspersky_sc_actions vendor_action OUTPUT action

[kaspersky:gnrl]
pulldown_type = false
category = Network & Security

KV_MODE = none
REPORT-basefields = kaspersky_basefields
REPORT-fields = kaspersky_EVC_EV_DISP_HOST_NAME, kaspersky_dest

EXTRACT-result = EVC_EV_DESC\=Result\:\s+(?P<result>[^\:]*)\:\s*(?P<signature>[^\\]*)(?:\\r\\nUser\:\s+(?P<user>(?:\w*\\)?[^\\]*))?\\r\\nObject\:\s+(?P<file_path>[^\t]*)\t
EXTRACT-signature = EVC_EV_VIRUS_NAME=(?P<signature>[^\t\r\n\s]*)
EXTRACT-userpath = (?:(?:Users)|(?:Documents and Settings))\\\\(?P<user>\w+)


EVAL-dest = coalesce(dest_name,dest_ip,dest_host,dest)
EVAL-src = coalesce(src_name,src_ip,src_host,src)

[kaspersky:klnag]
pulldown_type = false
category = Network & Security

KV_MODE = none
REPORT-basefields = kaspersky_basefields

EXTRACT-dest = EVC_EV_DISP_HOST_NAME=(?P<dest_host>[^\t]*)
EXTRACT-info1 = EVC_EV_DESC=Installation of update \'(?P<file_name>[^\']*)\' for modules of application \'(?P<app>[^\']*)\' has been (?P<state>successfully|started)
EXTRACT-info2 = EVC_EV_DESC=\'(?P<application>[^\']*)\' version \'(?P<application_version>[^\']*)\' has been (?P<action>removed|installed)

EVAL-status = "installed"

EVAL-dest = coalesce(dest_name,dest_ip,dest_host,dest)
EVAL-src = coalesce(src_name,src_ip,src_host,src)

[kaspersky:klprci]
pulldown_type = false
category = Network & Security

KV_MODE = none
REPORT-basefields = kaspersky_basefields

EVAL-dest = coalesce(dest_name,dest_ip,dest_host,dest)
EVAL-src = coalesce(src_name,src_ip,src_host,src)
